# Working With Country Population Data From The CIA World Factbook Database

This project uses SQLite aggregate functions and subqueries to extract data based on questions regarding the following country attributes;

* Population
* Population Growth
* Land area
* Water area
* Birth rate
* Death Rate

## Load The Database And Return Table Information

In [13]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [14]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

## Show The Top 5 Rows

In [15]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

## Find The Minimum And Maximum Values For Population And Population Growth

In [16]:
%%sql
SELECT MIN(population), MAX(population), 
MIN(population_growth), MAX(population_growth)
  FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

## Find The Countries With The Lowest And Highest Population

In [17]:
%%sql
SELECT name, MIN(population)
FROM facts;

Done.

[('Antarctica', 0)]

In [18]:
%%sql
SELECT name, MAX(population)
  FROM facts;

Done.

[('World', 7256490011)]

## Exclude 'World' From The Search

In [19]:
%%sql
SELECT MIN(population), MAX(population), 
MIN(population_growth), MAX(population_growth)
  FROM facts
WHERE name != 'World';

Done.

[(0, 1367485388, 0.0, 4.02)]

In [20]:
%%sql
SELECT name, MAX(population)
FROM facts
WHERE name <> 'World';

Done.

[('China', 1367485388)]

## Find Average Population And Average Area

In [21]:
%%sql
SELECT AVG(population), AVG(area)
FROM facts;

Done.

[(62094928.32231405, 555093.546184739)]

## Find Countries Where Population Is Higher Than The Average And Area Is Less Than The Average

In [22]:
%%sql
SELECT name, population, area
FROM facts
WHERE population > (SELECT AVG(population)
                    FROM facts)
AND area < (SELECT AVG(area)
            FROM facts);

Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Japan', 126919659, 377915),
 ('Philippines', 100998376, 300000),
 ('Thailand', 67976405, 513120),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]

## Find The Maximum Population Growth

In [23]:
%%sql
SELECT name, MAX(population_growth)
FROM facts;

Done.

[('South Sudan', 4.02)]

## Find The Countries With The Largest Water Area

In [24]:
%%sql
SELECT name, ROUND(CAST(area_water AS Float) / CAST(area_land AS Float), 6) AS ratio_water_to_land
FROM facts
ORDER BY ratio_water_to_land DESC
LIMIT 20;

Done.

[('British Indian Ocean Territory', 905.666667),
 ('Virgin Islands', 4.520231),
 ('Puerto Rico', 0.554791),
 ('Bahamas, The', 0.386613),
 ('Guinea-Bissau', 0.284673),
 ('Malawi', 0.259396),
 ('Netherlands', 0.22571),
 ('Uganda', 0.222922),
 ('Eritrea', 0.164356),
 ('Liberia', 0.15624),
 ('Bangladesh', 0.140509),
 ('Gambia, The', 0.116601),
 ('Taiwan', 0.115313),
 ('Finland', 0.112996),
 ('India', 0.105634),
 ('Canada', 0.098),
 ('Sweden', 0.097384),
 ('Colombia', 0.096476),
 ('Brunei', 0.094967),
 ('Guyana', 0.09205)]

In [25]:
%%sql
SELECT name
FROM facts
WHERE area_water > area_land;

Done.

[('British Indian Ocean Territory',), ('Virgin Islands',)]

## Find The Population Increase

In [26]:
%%sql
SELECT name, birth_rate - death_rate AS pop_increase
FROM facts
ORDER BY pop_increase DESC
LIMIT 20;

Done.

[('Malawi', 33.150000000000006),
 ('Uganda', 33.1),
 ('Niger', 33.03),
 ('Burundi', 32.739999999999995),
 ('Mali', 32.1),
 ('Burkina Faso', 30.310000000000002),
 ('Zambia', 29.46),
 ('Ethiopia', 29.080000000000005),
 ('South Sudan', 28.729999999999997),
 ('Tanzania', 28.39),
 ('Gaza Strip', 28.07),
 ('Timor-Leste', 28.059999999999995),
 ('Benin', 27.810000000000002),
 ('Iraq', 27.68),
 ('Angola', 27.29),
 ('Sao Tome and Principe', 26.989999999999995),
 ('Togo', 26.870000000000005),
 ('Somalia', 26.830000000000005),
 ('Mozambique', 26.479999999999997),
 ('Guinea', 26.28)]

## Find Countries Where The Death Rate Is Greater Than The Birth Rate

In [27]:
%%sql
SELECT name
FROM facts
WHERE death_rate > birth_rate;

Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Italy',),
 ('Japan',),
 ('Latvia',),
 ('Lithuania',),
 ('Moldova',),
 ('Monaco',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Russia',),
 ('Serbia',),
 ('Slovenia',),
 ('Ukraine',),
 ('Saint Pierre and Miquelon',)]